sigfox-tech-radio/sigfox-ep-rf-api-st-stm32wl3x/src/manuf/stm32wl3x_rf_api.c
/*!*****************************************************************
 * \file    stm32wl3x_rf_api.c
 * \brief   Sigfox STM32WL3X RF API implementation.
 *******************************************************************
 * \copyright
 *
 * Copyright (c) 2022, UnaBiz SAS
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 *  1 Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *  2 Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *  3 Neither the name of UnaBiz SAS nor the names of its contributors may be
 *    used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
 * BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
 * IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 *******************************************************************/

#include "manuf/stm32wl3x_rf_api.h"

#ifndef SIGFOX_EP_DISABLE_FLAGS_FILE
#include "sigfox_ep_flags.h"
#endif
#include "sigfox_types.h"
#include "sigfox_error.h"
#include "manuf/mcu_api.h"
#include "manuf/rf_api.h"
// Internal radio driver.
#include "stm32wl3x_hal_mrsubg.h"
#include "stm32wl3x_ll_bus.h"
#include "stm32wl3x_ll_mrsubg.h"
#include "stm32wl3x.h"
// STM32WL3X hardware driver.
#include "board/stm32wl3x_hw_api.h"

/*** RF API local macros ***/

#define STM32WL3X_RF_API_FREQUENCY_MIN_HZ                   826000000
#define STM32WL3X_RF_API_FREQUENCY_MAX_HZ                   958000000

#define STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES          40

#define STM32WL3X_RF_API_POLAR_DATARATE_MULTIPLIER          8

#define STM32WL3X_RF_API_FDEV_NEGATIVE                      0x7F // FDEV * (+1)
#define STM32WL3X_RF_API_FDEV_POSITIVE                      0x81 // FDEV * (-1)

#define STM32WL3X_RF_API_DBM_BUFFER_DEPTH                   2
#define STM32WL3X_RF_API_DBM_BUFFER_SIZE_BYTES              (STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES << 1) // Size is twice to store PA and FDEV values.
#define STM32WL3X_RF_API_DBM_BUFFER_FDEV_IDX                (STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES >> 1) // Index where deviation is performed to invert phase.
#define STM32WL3X_RF_API_DBM_TX_ALMOST_EMPTY_THRESHOLD      (STM32WL3X_RF_API_DBM_BUFFER_SIZE_BYTES >> 1) // Threshold set to the middle of a symbol.

#define STM32WL3X_RF_API_DL_BANDWIDTH_HZ                    2100
#ifdef SIGFOX_EP_BIDIRECTIONAL
#define STM32WL3X_RF_API_DL_PR_SIZE_BITS                    16
#define STM32WL3X_RF_API_DL_RSSI_THRESHOLD_DBM              -139
#define STM32WL3X_RF_API_DL_PHY_CONTENT_BUFFER_SIZE_BYTES   (((SIGFOX_DL_PHY_CONTENT_SIZE_BYTES >> 2) << 2) + 4)
#endif

#define STM32WL3X_RF_API_SEND_LATENCY_MARGIN_US             200

#define STM32WL3X_RF_API_TIMEOUT_COUNT                      1000000

/*** STM32WL3X RF API local structures ***/

/*******************************************************************/
typedef enum {
    STM32WL3X_RF_API_STATE_READY = 0,
    STM32WL3X_RF_API_STATE_TX_RAMP_UP,
    STM32WL3X_RF_API_STATE_TX_BITSTREAM,
    STM32WL3X_RF_API_STATE_TX_RAMP_DOWN,
    STM32WL3X_RF_API_STATE_TX_PADDING_BIT,
    STM32WL3X_RF_API_STATE_TX_END,
#ifdef SIGFOX_EP_BIDIRECTIONAL
    STM32WL3X_RF_API_STATE_RX_START,
    STM32WL3X_RF_API_STATE_RX,
#endif
    STM32WL3X_RF_API_STATE_LAST
} STM32WL3X_RF_API_state_t;

/*******************************************************************/
typedef union {
    struct {
        unsigned radio_irq_enable :1;
        unsigned radio_irq_process :1;
        unsigned tx_almost_empty :1;
        unsigned tx_almost_empty_0 :1;
        unsigned tx_almost_empty_1 :1;
#ifdef SIGFOX_EP_BIDIRECTIONAL
        unsigned rx_ok :1;
#endif
    } field;
    sfx_u8 all;
} STM32WL3X_RF_API_flags_t;

/*******************************************************************/
typedef struct {
    // Common.
    RF_API_config_t config;
    STM32WL3X_RF_API_state_t state;
    volatile STM32WL3X_RF_API_flags_t flags;
    // TX.
    // Warning: ramp and symbol buffers size must be a multiple of 4 because DBM peripheral only performs 32-bits access.
    sfx_u8 tx_bitstream[SIGFOX_UL_BITSTREAM_SIZE_BYTES];
    sfx_u8 tx_bitstream_size_bytes;
    sfx_u8 tx_byte_idx;
    sfx_u8 tx_bit_idx;
    sfx_u8 tx_fdev;
    sfx_u8 tx_ramp_amplitude_profile[STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES];
    sfx_u8 tx_bit0_amplitude_profile[STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES];
    volatile sfx_u8 __attribute__((aligned(32))) tx_dbm_buffer[STM32WL3X_RF_API_DBM_BUFFER_DEPTH][STM32WL3X_RF_API_DBM_BUFFER_SIZE_BYTES];
    volatile sfx_u8 *tx_dbm_buffer_ptr;
#ifdef SIGFOX_EP_ASYNCHRONOUS
    RF_API_tx_cplt_cb_t tx_cplt_cb;
#endif
#ifdef SIGFOX_EP_BIDIRECTIONAL
    // RX.
    // Warning: buffers size must be a multiple of 4 because DBM peripheral only performs 32-bits access.
    volatile sfx_u8 __attribute__((aligned(32))) rx_dbm_buffer[STM32WL3X_RF_API_DBM_BUFFER_DEPTH][STM32WL3X_RF_API_DL_PHY_CONTENT_BUFFER_SIZE_BYTES];
    volatile sfx_u8 *rx_dbm_buffer_ptr;
    sfx_s16 dl_rssi_dbm;
    sfx_u32 sync_word_u32;
#ifdef SIGFOX_EP_ASYNCHRONOUS
    RF_API_rx_data_received_cb_t rx_data_received_cb;
#endif
#endif
} STM32WL3X_RF_API_context_t;

/*** STM32WL3X RF API local global variables ***/

#ifdef SIGFOX_EP_VERBOSE
static const sfx_u8 STM32WL3X_RF_API_VERSION[] = "v2.0";
#endif
// Maximum output power depending on PA drive mode.
static const sfx_s8 STM32WL3X_RF_API_TX_POWER_MAX_DBM[STM32WL3X_HW_API_PA_DRIVE_MODE_LAST] = { 10, 14, 20 };
// Amplitude profile tables for ramp and bit 0 transmission at maximum output power.
static const sfx_u8 STM32WL3X_RF_API_RAMP_AMPLITUDE_PROFILE[STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES] = { 81, 81, 81, 81, 80, 80, 80, 79, 79, 79, 77, 77, 77, 76, 76, 75, 74, 73, 72, 71, 70, 69, 68, 67, 65, 63, 61, 59, 56, 53, 50, 46, 42, 38, 34, 28, 22, 15, 0 };
static const sfx_u8 STM32WL3X_RF_API_BIT0_AMPLITUDE_PROFILE[STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES] = { 81, 81, 81, 80, 80, 79, 79, 78, 76, 74, 71, 68, 63, 59, 55, 51, 45, 34, 22, 0, 0, 22, 34, 45, 51, 55, 59, 63, 68, 71, 74, 76, 78, 79, 79, 80, 80, 81, 81, 81 };
#ifdef SIGFOX_EP_BIDIRECTIONAL
static const sfx_u8 STM32WL3X_RF_API_SIGFOX_DL_FT[SIGFOX_DL_FT_SIZE_BYTES] = SIGFOX_DL_FT;
#endif
#if (defined SIGFOX_EP_TIMER_REQUIRED) && (defined SIGFOX_EP_LATENCY_COMPENSATION)
// Latency values (for core clock at 32MHz and SPI interface at 8MHz).
static sfx_u32 STM32WL3X_RF_API_LATENCY_MS[RF_API_LATENCY_LAST] = {
    0, // Wake-up (8.6µs + HW latency).
    3, // TX init (3.3ms).
    0, // Send start (depends on bit rate and will be computed during init function).
    0, // Send stop (depends on bit rate and will be computed during init function).
    0, // TX de-init (150µs).
    0, // Sleep (5µs + HW latency).
#ifdef SIGFOX_EP_BIDIRECTIONAL
    4, // RX init (3.4ms).
    1, // Receive start (130µs).
    0, // Receive stop (6µs).
    0, // RX de-init (15µs).
#endif
};
#endif
static STM32WL3X_RF_API_context_t stm32wl3x_rf_api_ctx;

/*** STM32WL3X RF API local functions ***/

/*******************************************************************/
void MR_SUBG_IRQHandler(void) {
    // Check buffer 0 flag.
    if ((MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS) & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_0_F) {
        // Set local flags if IRQ is enabled.
        stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty_0 = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        stm32wl3x_rf_api_ctx.flags.field.radio_irq_process = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        // Clear peripheral flag.
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS |= MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_0_F;
    }
    // Check buffer 1 flag.
    if ((MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS) & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_1_F) {
        // Set local flags.
        stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty_1 = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        stm32wl3x_rf_api_ctx.flags.field.radio_irq_process = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        // Clear peripheral flag.
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS |= MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_ALMOST_EMPTY_1_F;
    }
#ifdef SIGFOX_EP_BIDIRECTIONAL
    // Check RX done flag.
    if (((MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS) & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F) != 0) {
        // Set local flags.
        stm32wl3x_rf_api_ctx.flags.field.rx_ok = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        stm32wl3x_rf_api_ctx.flags.field.radio_irq_process = stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable;
        // Clear peripheral flag.
        MR_SUBG_GLOB_STATUS->RFSEQ_IRQ_STATUS |= MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F;
    }
#endif
#ifdef SIGFOX_EP_ASYNCHRONOUS
    // Call Sigfox callback to process IRQ in main context.
    if (stm32wl3x_rf_api_ctx.flags.field.radio_irq_process != 0) {
        // Set local flags.
        stm32wl3x_rf_api_ctx.config.process_cb();
    }
#endif
}

/*******************************************************************/
static void _STM32WL3X_rf_api_update_tx_dbm_buffer(void) {
    // Update pointer.
    if (stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty_0 != 0) {
        // Move local pointer to buffer 1 and clear flag.
        stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr = &(stm32wl3x_rf_api_ctx.tx_dbm_buffer[1][0]);
        stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty_0 = 0;
    }
    if (stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty_1 != 0) {
        // Move local pointer to buffer 0 and clear flag.
        stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr = &(stm32wl3x_rf_api_ctx.tx_dbm_buffer[0][0]);
        stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty_1 = 0;
    }
    // Clear global flag.
    stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty = 0;
}

#ifdef SIGFOX_EP_BIDIRECTIONAL
/*******************************************************************/
static void _STM32WL3X_rf_api_update_rx_dbm_buffer(void) {
    // Check buffer in use.
    sfx_u8 buffer_in_use = (((MR_SUBG_GLOB_STATUS->DATABUFFER_INFO) >> MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_Pos) & 0x00000001);
    // Update local pointer.
    stm32wl3x_rf_api_ctx.rx_dbm_buffer_ptr = (sfx_u8*) stm32wl3x_rf_api_ctx.rx_dbm_buffer[buffer_in_use];
}
#endif

/*******************************************************************/
static void _STM32WL3X_rf_api_reset_context(void) {
#ifdef SIGFOX_EP_BIDIRECTIONAL
    // Local variables.
    sfx_u8 idx = 0;
#endif
    // Init context.
    stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_READY;
    stm32wl3x_rf_api_ctx.flags.all = 0;
    stm32wl3x_rf_api_ctx.config.rc = SIGFOX_NULL;
    stm32wl3x_rf_api_ctx.tx_bitstream_size_bytes = 0;
    stm32wl3x_rf_api_ctx.tx_byte_idx = 0;
    stm32wl3x_rf_api_ctx.tx_bit_idx = 0;
#ifdef SIGFOX_EP_ASYNCHRONOUS
    stm32wl3x_rf_api_ctx.config.process_cb = SIGFOX_NULL;
    stm32wl3x_rf_api_ctx.config.error_cb = SIGFOX_NULL;
#endif
#ifdef SIGFOX_EP_BIDIRECTIONAL
    // Build synchronization word in integer format (0xB2270000).
    stm32wl3x_rf_api_ctx.sync_word_u32 = 0;
    for (idx = 0; idx < SIGFOX_DL_FT_SIZE_BYTES; idx++) {
        stm32wl3x_rf_api_ctx.sync_word_u32 |= STM32WL3X_RF_API_SIGFOX_DL_FT[idx] << ((3 - idx) << 3);
    }
#endif
}

/*******************************************************************/
static RF_API_status_t _STM32WL3X_rf_api_wait_for_state_switch(MRSubGFSMState new_state) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    sfx_u32 loop_count = 0;
    // Wait until state is reached.
    while (LL_MRSubG_GetRadioFSMState() != new_state) {
        // Manage timeout.
        loop_count++;
        if (loop_count > STM32WL3X_RF_API_TIMEOUT_COUNT) {
            SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_STATE_SWITCH_TIMEOUT);
        }
    }
errors:
    SIGFOX_RETURN();
}

/*******************************************************************/
static void _STM32WL3X_rf_api_compute_amplitude_tables(sfx_s8 stm32wl3x_tx_power_dbm, sfx_u8 pa_drive_mode_index) {
    // Local variables.
    sfx_u8 pa_value_min = STM32WL3X_RF_API_RAMP_AMPLITUDE_PROFILE[STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES - 1];
    sfx_u8 pa_value_max = STM32WL3X_RF_API_RAMP_AMPLITUDE_PROFILE[0];
    sfx_u8 new_pa_value_max = 0;
    sfx_u8 idx = 0;
    // Compute maximum PA value for the given output power.
    if (stm32wl3x_tx_power_dbm >= STM32WL3X_RF_API_TX_POWER_MAX_DBM[pa_drive_mode_index]) {
        new_pa_value_max = pa_value_max;
    }
    else {
        new_pa_value_max = (sfx_u8) (pa_value_max - ((STM32WL3X_RF_API_TX_POWER_MAX_DBM[pa_drive_mode_index] - stm32wl3x_tx_power_dbm) << 1));
    }
    // Sub-symbols loop.
    for (idx = 0; idx < STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES; idx++) {
        // Compute amplitude tables.
        stm32wl3x_rf_api_ctx.tx_ramp_amplitude_profile[idx] = (sfx_u8) (pa_value_min + ((STM32WL3X_RF_API_RAMP_AMPLITUDE_PROFILE[idx] - pa_value_min) * (new_pa_value_max - pa_value_min)) / (pa_value_max - pa_value_min));
        stm32wl3x_rf_api_ctx.tx_bit0_amplitude_profile[idx] = (sfx_u8) (pa_value_min + ((STM32WL3X_RF_API_BIT0_AMPLITUDE_PROFILE[idx] - pa_value_min) * (new_pa_value_max - pa_value_min)) / (pa_value_max - pa_value_min));
    }
}

/*******************************************************************/
static RF_API_status_t _STM32WL3X_rf_api_internal_process(void) {
    // Local variables.
    sfx_u8 idx = 0;
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    // Perform state machine.
    switch (stm32wl3x_rf_api_ctx.state) {
    case STM32WL3X_RF_API_STATE_READY:
        // Nothing to do.
        break;
    case STM32WL3X_RF_API_STATE_TX_RAMP_UP:
        // Fill ramp-up.
        for (idx = 0; idx < STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES; idx++) {
            stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 0] = 0; // Deviation.
            stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 1] = stm32wl3x_rf_api_ctx.tx_ramp_amplitude_profile[STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES - idx - 1]; // PA output power.
        }
        // Enable interrupt.
        stm32wl3x_rf_api_ctx.flags.all = 0;
        stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable = 1;
        // Start radio.
        LL_MRSubG_StrobeCommand(CMD_LOCKTX);
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_LOCKONTX);
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_wait_for_state_switch(STATE_LOCKONTX);
#endif
        LL_MRSubG_StrobeCommand(CMD_TX);
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_TX);
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_wait_for_state_switch(STATE_TX);
#endif
        // Update state.
        stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_TX_BITSTREAM;
        break;
    case STM32WL3X_RF_API_STATE_TX_BITSTREAM:
        // Check DBM flag.
        if (stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty != 0) {
            // Update TX buffer pointer.
            _STM32WL3X_rf_api_update_tx_dbm_buffer();
            // Check bit.
            if ((stm32wl3x_rf_api_ctx.tx_bitstream[stm32wl3x_rf_api_ctx.tx_byte_idx] & (1 << (7 - stm32wl3x_rf_api_ctx.tx_bit_idx))) == 0) {
                // Phase shift and amplitude shaping required.
                stm32wl3x_rf_api_ctx.tx_fdev = (stm32wl3x_rf_api_ctx.tx_fdev == STM32WL3X_RF_API_FDEV_NEGATIVE) ? STM32WL3X_RF_API_FDEV_POSITIVE : STM32WL3X_RF_API_FDEV_NEGATIVE; // Toggle deviation.
                for (idx = 0; idx < STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES; idx++) {
                    stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 0] = (idx == STM32WL3X_RF_API_DBM_BUFFER_FDEV_IDX) ? stm32wl3x_rf_api_ctx.tx_fdev : 0; // Deviation.
                    stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 1] = stm32wl3x_rf_api_ctx.tx_bit0_amplitude_profile[idx]; // PA output power.
                }
            }
            else {
                // Constant CW.
                for (idx = 0; idx < STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES; idx++) {
                    stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 0] = 0; // Deviation.
                    stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 1] = stm32wl3x_rf_api_ctx.tx_bit0_amplitude_profile[0]; // PA output power.
                }
            }
            // Increment bit index..
            stm32wl3x_rf_api_ctx.tx_bit_idx++;
            if (stm32wl3x_rf_api_ctx.tx_bit_idx >= 8) {
                // Reset bit index.
                stm32wl3x_rf_api_ctx.tx_bit_idx = 0;
                // Increment byte index.
                stm32wl3x_rf_api_ctx.tx_byte_idx++;
                // Check end of bitstream.
                if (stm32wl3x_rf_api_ctx.tx_byte_idx >= (stm32wl3x_rf_api_ctx.tx_bitstream_size_bytes)) {
                    stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_TX_RAMP_DOWN;
                }
            }
        }
        break;
    case STM32WL3X_RF_API_STATE_TX_RAMP_DOWN:
        // Check DBM flag.
        if (stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty != 0) {
            // Update TX buffer pointer.
            _STM32WL3X_rf_api_update_tx_dbm_buffer();
            // Fill ramp-down.
            for (idx = 0; idx < STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES; idx++) {
                stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 0] = 0; // FDEV.
                stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[(idx << 1) + 1] = stm32wl3x_rf_api_ctx.tx_ramp_amplitude_profile[idx]; // PA output power for ramp-down.
            }
            // Update state.
            stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_TX_PADDING_BIT;
        }
        break;
    case STM32WL3X_RF_API_STATE_TX_PADDING_BIT:
        // Check DBM flag.
        if (stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty != 0) {
            // Update TX buffer pointer.
            _STM32WL3X_rf_api_update_tx_dbm_buffer();
            // Padding bit to ensure last ramp down is completely transmitted.
            for (idx = 0; idx < STM32WL3X_RF_API_DBM_BUFFER_SIZE_BYTES; idx++) {
                stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr[idx] = 0x00;
            }
            // Update state.
            stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_TX_END;
        }
        break;
    case STM32WL3X_RF_API_STATE_TX_END:
        // Check DBM flag.
        if (stm32wl3x_rf_api_ctx.flags.field.tx_almost_empty != 0) {
            // Stop radio.
            LL_MRSubG_StrobeCommand(CMD_SABORT);
            // Disable interrupt.
            stm32wl3x_rf_api_ctx.flags.all = 0;
#ifdef SIGFOX_EP_ASYNCHRONOUS
            // Call TX completion callback.
            stm32wl3x_rf_api_ctx.tx_cplt_cb();
#endif
            // Update state.
            stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_READY;
        }
        break;
#ifdef SIGFOX_EP_BIDIRECTIONAL
    case STM32WL3X_RF_API_STATE_RX_START:
        // Enable external GPIO interrupt.
        stm32wl3x_rf_api_ctx.flags.all = 0;
        stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable = 1;
        // Start radio.
        LL_MRSubG_StrobeCommand(CMD_LOCKRX);
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_LOCKONRX);
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_wait_for_state_switch(STATE_LOCKONRX);
#endif
        LL_MRSubG_StrobeCommand(CMD_RX);
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_RX);
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_wait_for_state_switch(STATE_RX);
#endif
        // Update state.
        stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_RX;
        break;
    case STM32WL3X_RF_API_STATE_RX:
        // Check RX data flag.
        if (stm32wl3x_rf_api_ctx.flags.field.rx_ok != 0) {
            // Update DBM pointer and RSSI.
            _STM32WL3X_rf_api_update_rx_dbm_buffer();
            stm32wl3x_rf_api_ctx.dl_rssi_dbm = (sfx_s16) HAL_MRSubG_GetRssidBm();
            // Stop radio.
            LL_MRSubG_StrobeCommand(CMD_SABORT);
            // Clear flag.
            stm32wl3x_rf_api_ctx.flags.field.rx_ok = 0;
            // Disable interrupt.
            stm32wl3x_rf_api_ctx.flags.field.radio_irq_enable = 0;
#ifdef SIGFOX_EP_ASYNCHRONOUS
            // Call RX completion callback.
            stm32wl3x_rf_api_ctx.rx_data_received_cb();
#endif
            // Update state.
            stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_READY;
        }
        break;
#endif /* SIGFOX_EP_BIDIRECTIONAL */
    default:
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_STATE);
        break;
    }
errors:
    // Clear process flag.
    stm32wl3x_rf_api_ctx.flags.field.radio_irq_process = 0;
    SIGFOX_RETURN();
}

/*** STM32WL3X RF API functions ***/

#if (defined SIGFOX_EP_ASYNCHRONOUS) || (defined SIGFOX_EP_LOW_LEVEL_OPEN_CLOSE)
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_open(RF_API_config_t *rf_api_config) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
    STM32WL3X_HW_API_status_t STM32WL3X_hw_api_status = STM32WL3X_HW_API_SUCCESS;
#endif
    STM32WL3X_HW_API_config_t hw_config;
    // Reset context.
    _STM32WL3X_rf_api_reset_context();
    // Save parameters.
    stm32wl3x_rf_api_ctx.config.rc = (rf_api_config->rc);
#ifdef SIGFOX_EP_ASYNCHRONOUS
    stm32wl3x_rf_api_ctx.config.process_cb = (rf_api_config -> process_cb);
    stm32wl3x_rf_api_ctx.config.error_cb = (rf_api_config -> error_cb);
#endif
    // Init board.
    hw_config.rc = (rf_api_config->rc);
#ifdef SIGFOX_EP_ERROR_CODES
    STM32WL3X_hw_api_status = STM32WL3X_HW_API_open(&hw_config);
    STM32WL3X_HW_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_STM32WL3X_HW_API);
#else
    STM32WL3X_HW_API_open(&hw_config);
#endif
#ifdef SIGFOX_EP_ERROR_CODES
errors:
#endif
    SIGFOX_RETURN();
}
#endif

