sigfox-tech-radio/sigfox-ep-rf-api-st-stm32wl3x/src/manuf/stm32wl3x_rf_api.c
#ifdef SIGFOX_EP_LOW_LEVEL_OPEN_CLOSE
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_close(void) {
#ifdef SIGFOX_EP_ERROR_CODES
    // Local variables.
    RF_API_status_t status = RF_API_SUCCESS;
    STM32WL3X_HW_API_status_t STM32WL3X_hw_api_status = STM32WL3X_HW_API_SUCCESS;
#endif
    // Reset context.
    _STM32WL3X_rf_api_reset_context();
    // De-init board.
#ifdef SIGFOX_EP_ERROR_CODES
    STM32WL3X_hw_api_status = STM32WL3X_HW_API_close();
    STM32WL3X_HW_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_STM32WL3X_HW_API);
#else
    STM32WL3X_HW_API_close();
#endif
#ifdef SIGFOX_EP_ERROR_CODES
errors:
#endif
    SIGFOX_RETURN();
}
#endif

#ifdef SIGFOX_EP_ASYNCHRONOUS
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_process(void) {
#ifdef SIGFOX_EP_ERROR_CODES
    // Local variables.
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    // Run internal process.
    while (stm32wl3x_rf_api_ctx.flags.field.radio_irq_process != 0) {
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_internal_process();
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_internal_process();
#endif
    }
#ifdef SIGFOX_EP_ERROR_CODES
errors:
#endif
    SIGFOX_RETURN();
}
#endif

/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_wake_up(void) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    sfx_u32 loop_count = 0;
    // Turn radio on.
    PWR->CR2 |= PWR_CR2_RFREGEN;
    // Wait for RF regulator to be stable.
    while (((PWR->CR2) & PWR_CR2_RFREGRDY) == 0) {
        loop_count++;
        if (loop_count > STM32WL3X_RF_API_TIMEOUT_COUNT) {
            SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_REGULATOR_READY);
        }
    }
    // Enable peripheral clock.
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_MRSUBG);
errors:
    SIGFOX_RETURN();
}

/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_sleep(void) {
#ifdef SIGFOX_EP_ERROR_CODES
    // Local variables.
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    // Disable peripheral clock.
    LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_MRSUBG);
    // Turn radio off.
    PWR->CR2 &= ~(PWR_CR2_RFREGEN);
    SIGFOX_RETURN();
}

/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_init(RF_API_radio_parameters_t *radio_parameters) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
    STM32WL3X_HW_API_status_t STM32WL3X_hw_api_status = STM32WL3X_HW_API_SUCCESS;
#endif
    STM32WL3X_radio_parameters_t STM32WL3X_hw_radio_parameters;
    SMRSubGConfig radio_config;
    STM32WL3X_HW_API_pa_drive_mode_t pa_drive_mode = STM32WL3X_HW_API_PA_DRIVE_MODE_LAST;
    MRSubG_PA_DRVMode mrsubg_pa_drive_mode = 0;
    sfx_s8 expected_tx_power_dbm = 0;
    sfx_s8 tx_power_dbm = 0;
#ifdef SIGFOX_EP_BIDIRECTIONAL
    MRSubG_PcktBasicFields downlink_pkt_init;
#endif
    // Common parameters.
    radio_config.outputPower = 0;
    radio_config.dsssExp = 0;
    radio_config.lBandwidth = STM32WL3X_RF_API_DL_BANDWIDTH_HZ;
    // Frequency.
#ifdef SIGFOX_EP_PARAMETERS_CHECK
    if (((radio_parameters->frequency_hz) < STM32WL3X_RF_API_FREQUENCY_MIN_HZ) || ((radio_parameters->frequency_hz) > STM32WL3X_RF_API_FREQUENCY_MAX_HZ)) {
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_FREQUENCY);
    }
#endif
    radio_config.lFrequencyBase = (radio_parameters->frequency_hz);
    // Modulation and bit rate.
    switch (radio_parameters->modulation) {
    case RF_API_MODULATION_NONE:
        radio_config.xModulationSelect = MOD_CW;
        radio_config.lDatarate = 100; // Unused value but should be > 0 to be able to stop CW with SABORT command.
#ifdef SIGFOX_EP_BIDIRECTIONAL
        radio_config.lFreqDev = (radio_parameters->deviation_hz);
#else
        radio_config.lFreqDev = 0;
#endif
        // Disable PA ramp (workaround to be able to stop CW with SABORT command).
        MR_SUBG_GLOB_STATIC->PA_CONFIG &= ~MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE;
        MR_SUBG_GLOB_STATIC->PA_CONFIG &= ~MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH;
        break;
    case RF_API_MODULATION_DBPSK:
        radio_config.xModulationSelect = MOD_POLAR;
        radio_config.lDatarate = (sfx_u32) (((radio_parameters->bit_rate_bps) * STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES) / (STM32WL3X_RF_API_POLAR_DATARATE_MULTIPLIER));
        radio_config.lFreqDev = (sfx_u32) (((radio_parameters->bit_rate_bps) * STM32WL3X_RF_API_SYMBOL_PROFILE_SIZE_BYTES) >> 1);
        // Enable PA ramp.
        MR_SUBG_GLOB_STATIC->PA_CONFIG |= MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE;
        break;
    case RF_API_MODULATION_GFSK:
        radio_config.xModulationSelect = MOD_2GFSK1;
        radio_config.lDatarate = (radio_parameters->bit_rate_bps);
#ifdef SIGFOX_EP_BIDIRECTIONAL
        radio_config.lFreqDev = (radio_parameters->deviation_hz);
#else
        radio_config.lFreqDev = 0;
#endif
        // Enable PA ramp.
        MR_SUBG_GLOB_STATIC->PA_CONFIG |= MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE;
        break;
    default:
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_MODULATION);
        break;
    }
    HAL_MRSubG_Init(&radio_config);
    // Configure specific registers.
    switch (radio_parameters->rf_mode) {
    case RF_API_MODE_TX:
        // Enable IRQ of current buffer.
        MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = (MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_0_E | MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_ALMOST_EMPTY_1_E);
        // Set TX mode.
        LL_MRSubG_SetTXMode(TX_DIRECT_BUFFERS);
        LL_MRSUBG_SetPacketLength(0);
        LL_MRSubG_SetAlmostEmptyThresholdTx(STM32WL3X_RF_API_DBM_TX_ALMOST_EMPTY_THRESHOLD);
        LL_MRSubG_SetPAMode(PA_LEGACY);
        LL_MRSubG_SetPALevelMaxIndex(0);
        // Enable PA interpolator and clocking during lock.
        MR_SUBG_GLOB_STATIC->PA_CONFIG |= MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_INTERP_EN;
        MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG |= MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_PA_CLKON_LOCKONTX;
        // Set RAM buffers address and size.
        MR_SUBG_GLOB_STATIC->DATABUFFER0_PTR = (sfx_u32) &(stm32wl3x_rf_api_ctx.tx_dbm_buffer[0][0]);
        MR_SUBG_GLOB_STATIC->DATABUFFER1_PTR = (sfx_u32) &(stm32wl3x_rf_api_ctx.tx_dbm_buffer[1][0]);
        MR_SUBG_GLOB_STATIC->DATABUFFER_SIZE = (sfx_u32) STM32WL3X_RF_API_DBM_BUFFER_SIZE_BYTES;
        // DBM starts with buffer 0.
        stm32wl3x_rf_api_ctx.tx_dbm_buffer_ptr = &(stm32wl3x_rf_api_ctx.tx_dbm_buffer[0][0]);
        // Get effective output power to program.
#ifdef SIGFOX_EP_TX_POWER_DBM_EIRP
        expected_tx_power_dbm = SIGFOX_EP_TX_POWER_DBM_EIRP;
#else
        expected_tx_power_dbm = (radio_parameters->tx_power_dbm_eirp);
#endif
#ifdef SIGFOX_EP_ERROR_CODES
        STM32WL3X_hw_api_status = STM32WL3X_HW_API_get_tx_power(expected_tx_power_dbm, &tx_power_dbm, &pa_drive_mode);
        STM32WL3X_HW_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_STM32WL3X_HW_API);
#else
        STM32WL3X_HW_API_get_tx_power(expected_tx_power_dbm, &tx_power_dbm, &pa_drive_mode);
#endif
        // Check returned value.
        switch (pa_drive_mode) {
        case STM32WL3X_HW_API_PA_DRIVE_MODE_TX:
            mrsubg_pa_drive_mode = PA_DRV_TX;
            break;
        case STM32WL3X_HW_API_PA_DRIVE_MODE_TX_HP:
            mrsubg_pa_drive_mode = PA_DRV_TX_HP;
            break;
        case STM32WL3X_HW_API_PA_DRIVE_MODE_TX_TX_HP:
            mrsubg_pa_drive_mode = PA_DRV_TX_TX_HP;
            break;
        default:
            SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_PA_DRIVE_MODE);
        }
        // Check power.
        if (tx_power_dbm > STM32WL3X_RF_API_TX_POWER_MAX_DBM[pa_drive_mode]) {
            SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_TX_POWER);
        }
        // Set output power.
        if ((radio_parameters->modulation) == RF_API_MODULATION_NONE) {
            HAL_MRSubG_SetPALeveldBm(0, tx_power_dbm, mrsubg_pa_drive_mode);
        }
        else {
            LL_MRSubG_SetPADriveMode(mrsubg_pa_drive_mode);
            _STM32WL3X_rf_api_compute_amplitude_tables(tx_power_dbm, pa_drive_mode);
        }
#if (defined SIGFOX_EP_TIMER_REQUIRED) && (defined SIGFOX_EP_LATENCY_COMPENSATION)
        // Start latency = 1 symbol of ramp-up.
        STM32WL3X_RF_API_LATENCY_MS[RF_API_LATENCY_SEND_START] = ((1000 - STM32WL3X_RF_API_SEND_LATENCY_MARGIN_US) / ((sfx_u32) (radio_parameters->bit_rate_bps)));
        // Stop latency = 1 symbol of ramp-down + half of padding symbol (since IRQ is raised at the middle of the symbol).
        STM32WL3X_RF_API_LATENCY_MS[RF_API_LATENCY_SEND_STOP] = ((1500 - STM32WL3X_RF_API_SEND_LATENCY_MARGIN_US) / ((sfx_u32) (radio_parameters->bit_rate_bps)));
#endif
        break;
#if (defined SIGFOX_EP_BIDIRECTIONAL) || ((defined SIGFOX_EP_REGULATORY && (defined SIGFOX_EP_SPECTRUM_ACCESS_LBT)))
    case RF_API_MODE_RX:
#ifdef SIGFOX_EP_BIDIRECTIONAL
        // Configure IRQ.
        MR_SUBG_GLOB_DYNAMIC->RFSEQ_IRQ_ENABLE = MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E;
        // Set RX mode.
        LL_MRSubG_SetRXMode(RX_NORMAL);
        // Set RAM buffers address and size.
        MR_SUBG_GLOB_STATIC->DATABUFFER0_PTR = (sfx_u32) &(stm32wl3x_rf_api_ctx.rx_dbm_buffer[0]);
        MR_SUBG_GLOB_STATIC->DATABUFFER1_PTR = (sfx_u32) &(stm32wl3x_rf_api_ctx.rx_dbm_buffer[1]);
        MR_SUBG_GLOB_STATIC->DATABUFFER_SIZE = (sfx_u32) STM32WL3X_RF_API_DL_PHY_CONTENT_BUFFER_SIZE_BYTES;
        stm32wl3x_rf_api_ctx.rx_dbm_buffer_ptr = (sfx_u8*) &(stm32wl3x_rf_api_ctx.rx_dbm_buffer[0]);
        // RSSI threshold.
        HAL_MRSubG_SetRSSIThreshold(STM32WL3X_RF_API_DL_RSSI_THRESHOLD_DBM);
        // Disable equalization, antenna switching and carrier sense.
        LL_MRSubG_SetISIEqualizer(ISI_EQ_DISABLED);
        // Downlink packet structure.
        downlink_pkt_init.PreambleLength = STM32WL3X_RF_API_DL_PR_SIZE_BITS;
        downlink_pkt_init.PostambleLength = 0;
        downlink_pkt_init.SyncLength = ((SIGFOX_DL_FT_SIZE_BYTES << 3) - 1);
        downlink_pkt_init.SyncWord = stm32wl3x_rf_api_ctx.sync_word_u32;
        downlink_pkt_init.FixVarLength = FIXED;
        downlink_pkt_init.PreambleSequence = PRE_SEQ_1010;
        downlink_pkt_init.PostambleSequence = POST_SEQ_OTHER;
        downlink_pkt_init.CrcMode = PKT_NO_CRC;
        downlink_pkt_init.Coding = CODING_NONE;
        downlink_pkt_init.DataWhitening = DISABLE;
        downlink_pkt_init.LengthWidth = BYTE_LEN_1;
        downlink_pkt_init.SyncPresent = ENABLE;
        HAL_MRSubG_PacketBasicInit(&downlink_pkt_init);
        LL_MRSUBG_SetPacketLength(SIGFOX_DL_PHY_CONTENT_SIZE_BYTES);
        // Disable AFC.
        MR_SUBG_RADIO->AFC2_CONFIG &= ~MR_SUBG_RADIO_AFC2_CONFIG_AFC_EN;
        break;
#endif /* SIGFOX_EP_BIDIRECTIONAL */
#endif
    default:
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_MODE);
        break;
    }
    // Optional init on hardware side.
    STM32WL3X_hw_radio_parameters.rf_mode = (radio_parameters->rf_mode);
    STM32WL3X_hw_radio_parameters.expected_tx_power_dbm = expected_tx_power_dbm;
#ifdef SIGFOX_EP_ERROR_CODES
    STM32WL3X_hw_api_status = STM32WL3X_HW_API_init(&STM32WL3X_hw_radio_parameters);
    STM32WL3X_HW_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_STM32WL3X_HW_API);
#else
    STM32WL3X_HW_API_init(&STM32WL3X_hw_radio_parameters);
#endif
    // Go to ready state.
    LL_MRSubG_StrobeCommand(CMD_SABORT);
#ifdef SIGFOX_EP_ERROR_CODES
    status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_IDLE);
    SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
    _STM32WL3X_rf_api_wait_for_state_switch(STATE_IDLE);
#endif
    // Enable radio interrupt.
    NVIC_SetPriority(MR_SUBG_IRQn, 0);
    NVIC_EnableIRQ(MR_SUBG_IRQn);
errors:
    SIGFOX_RETURN();
}

/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_de_init(void) {
#ifdef SIGFOX_EP_ERROR_CODES
    // Local variables.
    RF_API_status_t status = RF_API_SUCCESS;
    STM32WL3X_HW_API_status_t STM32WL3X_hw_api_status = STM32WL3X_HW_API_SUCCESS;
#endif
    // Disable external GPIO interrupt.
    stm32wl3x_rf_api_ctx.flags.all = 0;
    // Stop radio.
    LL_MRSubG_StrobeCommand(CMD_SABORT);
#ifdef SIGFOX_EP_ERROR_CODES
    status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_IDLE);
    SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
    _STM32WL3X_rf_api_wait_for_state_switch(STATE_IDLE);
#endif
    // Optional release on hardware side.
#ifdef SIGFOX_EP_ERROR_CODES
    STM32WL3X_hw_api_status = STM32WL3X_HW_API_de_init();
    STM32WL3X_HW_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_STM32WL3X_HW_API);
#else
    STM32WL3X_HW_API_de_init();
#endif
#ifdef SIGFOX_EP_ERROR_CODES
errors:
#endif
    // Disable radio interrupt.
    NVIC_DisableIRQ(MR_SUBG_IRQn);
    SIGFOX_RETURN();
}

/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_send(RF_API_tx_data_t *tx_data) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    sfx_u8 idx = 0;
    // Store TX data.
    stm32wl3x_rf_api_ctx.tx_bitstream_size_bytes = (tx_data->bitstream_size_bytes);
    for (idx = 0; idx < (stm32wl3x_rf_api_ctx.tx_bitstream_size_bytes); idx++) {
        stm32wl3x_rf_api_ctx.tx_bitstream[idx] = (tx_data->bitstream)[idx];
    }
#ifdef SIGFOX_EP_ASYNCHRONOUS
    // Store callback.
    stm32wl3x_rf_api_ctx.tx_cplt_cb = (tx_data -> cplt_cb);
#endif
    // Init state.
    stm32wl3x_rf_api_ctx.tx_bit_idx = 0;
    stm32wl3x_rf_api_ctx.tx_byte_idx = 0;
    stm32wl3x_rf_api_ctx.flags.all = 0;
    // Trigger TX.
    stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_TX_RAMP_UP;
#ifdef SIGFOX_EP_ERROR_CODES
    status = _STM32WL3X_rf_api_internal_process();
    SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
    _STM32WL3X_rf_api_internal_process();
#endif
#ifndef SIGFOX_EP_ASYNCHRONOUS
    // Wait for transmission to complete.
    while (stm32wl3x_rf_api_ctx.state != STM32WL3X_RF_API_STATE_READY) {
        // Wait for radio interrupt.
        while (stm32wl3x_rf_api_ctx.flags.field.radio_irq_process == 0);
        // Call process function.
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_internal_process();
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_internal_process();
#endif
    }
#endif
#ifdef SIGFOX_EP_ERROR_CODES
errors:
#endif
    SIGFOX_RETURN();
}

#ifdef SIGFOX_EP_BIDIRECTIONAL
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_receive(RF_API_rx_data_t *rx_data) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#ifndef SIGFOX_EP_ASYNCHRONOUS
    MCU_API_status_t mcu_api_status = MCU_API_SUCCESS;
#endif
#endif
#ifdef SIGFOX_EP_ASYNCHRONOUS
    // Store callback.
    stm32wl3x_rf_api_ctx.rx_data_received_cb = (rx_data -> data_received_cb);
#else
    sfx_bool dl_timeout = SIGFOX_FALSE;
    // Reset flag.
    (rx_data->data_received) = SIGFOX_FALSE;
#endif
    // Init state.
    stm32wl3x_rf_api_ctx.flags.all = 0;
    // Trigger RX.
    stm32wl3x_rf_api_ctx.state = STM32WL3X_RF_API_STATE_RX_START;
#ifdef SIGFOX_EP_ERROR_CODES
    status = _STM32WL3X_rf_api_internal_process();
    SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
    _STM32WL3X_rf_api_internal_process();
#endif
#ifndef SIGFOX_EP_ASYNCHRONOUS
    // Wait for reception to complete.
    while (stm32wl3x_rf_api_ctx.state != STM32WL3X_RF_API_STATE_READY) {
        // Wait for GPIO interrupt.
        while (stm32wl3x_rf_api_ctx.flags.field.radio_irq_process == 0) {
            // Check timeout.
#ifdef SIGFOX_EP_ERROR_CODES
            mcu_api_status = MCU_API_timer_status(MCU_API_TIMER_INSTANCE_T_RX, &dl_timeout);
            MCU_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_MCU_API);
#else
            MCU_API_timer_status(MCU_API_TIMER_INSTANCE_T_RX, &dl_timeout);
#endif
            // Exit if timeout.
            if (dl_timeout == SIGFOX_TRUE) {
                // Stop radio.
                LL_MRSubG_StrobeCommand(CMD_SABORT);
                goto errors;
            }
        }
        // Call process function.
#ifdef SIGFOX_EP_ERROR_CODES
        status = _STM32WL3X_rf_api_internal_process();
        SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
        _STM32WL3X_rf_api_internal_process();
#endif
    }
    // Update status flag.
    (rx_data->data_received) = SIGFOX_TRUE;
#endif
#if (defined SIGFOX_EP_ERROR_CODES) || !(defined SIGFOX_EP_ASYNCHRONOUS)
errors:
#endif
    SIGFOX_RETURN();
}
#endif

#ifdef SIGFOX_EP_BIDIRECTIONAL
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_get_dl_phy_content_and_rssi(sfx_u8 *dl_phy_content, sfx_u8 dl_phy_content_size, sfx_s16 *dl_rssi_dbm) {
    // Local variables.
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    sfx_u8 idx = 0;
#ifdef SIGFOX_EP_PARAMETERS_CHECK
    // Check parameters.
    if ((dl_phy_content == SIGFOX_NULL) || (dl_rssi_dbm == SIGFOX_NULL)) {
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_NULL_PARAMETER);
    }
    if (dl_phy_content_size > SIGFOX_DL_PHY_CONTENT_SIZE_BYTES) {
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_BUFFER_SIZE);
    }
#endif
    // Fill data.
    for (idx = 0; idx < dl_phy_content_size; idx++) {
        dl_phy_content[idx] = stm32wl3x_rf_api_ctx.rx_dbm_buffer_ptr[idx];
    }
    (*dl_rssi_dbm) = (sfx_s16) stm32wl3x_rf_api_ctx.dl_rssi_dbm;
#ifdef SIGFOX_EP_PARAMETERS_CHECK
errors:
#endif
    SIGFOX_RETURN();
}
#endif

