sigfox-tech-radio/sigfox-ep-rf-api-st-stm32wl3x/src/manuf/stm32wl3x_rf_api.c
#if (defined SIGFOX_EP_REGULATORY) && (defined SIGFOX_EP_SPECTRUM_ACCESS_LBT)
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_carrier_sense(RF_API_carrier_sense_parameters_t *carrier_sense_params) {
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    /* To be implemented by the device manufacturer */
    SIGFOX_UNUSED(carrier_sense_params);
    SIGFOX_RETURN();
}
#endif

#if (defined SIGFOX_EP_TIMER_REQUIRED) && (defined SIGFOX_EP_LATENCY_COMPENSATION)
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_get_latency(RF_API_latency_t latency_type, sfx_u32 *latency_ms) {
    // Local variables.
    sfx_u32 hw_api_latency[STM32WL3X_HW_API_LATENCY_LAST];
    sfx_u8 idx = 0;
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
    STM32WL3X_HW_API_status_t STM32WL3X_hw_api_status = STM32WL3X_HW_API_SUCCESS;
#endif
#ifdef SIGFOX_EP_PARAMETERS_CHECK
    // Reset result.
    (*latency_ms) = 0;
    // Check parameter.
    if (latency_type >= RF_API_LATENCY_LAST) {
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_LATENCY_TYPE);
    }
#endif
    // Set base latency.
    (*latency_ms) = STM32WL3X_RF_API_LATENCY_MS[latency_type];
    // Read hardware latencies.
    for (idx = 0; idx < STM32WL3X_HW_API_LATENCY_LAST; idx++) {
        // Reset value.
        hw_api_latency[idx] = 0;
#ifdef SIGFOX_EP_ERROR_CODES
        STM32WL3X_hw_api_status = STM32WL3X_HW_API_get_latency(idx, &(hw_api_latency[idx]));
        STM32WL3X_HW_API_check_status((RF_API_status_t) STM32WL3X_RF_API_ERROR_DRIVER_STM32WL3X_HW_API);
#else
        STM32WL3X_HW_API_get_latency(idx, &(hw_api_latency[idx]));
#endif
    }
    // Add HW API latencies.
    if (latency_type == RF_API_LATENCY_INIT_TX) {
        (*latency_ms) += hw_api_latency[STM32WL3X_HW_API_LATENCY_INIT_TX];
    }
    if (latency_type == RF_API_LATENCY_DE_INIT_TX) {
        (*latency_ms) += hw_api_latency[STM32WL3X_HW_API_LATENCY_DE_INIT_TX];
    }
#ifdef SIGFOX_EP_BIDIRECTIONAL
    if (latency_type == RF_API_LATENCY_INIT_RX) {
        (*latency_ms) += hw_api_latency[STM32WL3X_HW_API_LATENCY_INIT_RX];
    }
    if (latency_type == RF_API_LATENCY_DE_INIT_RX) {
        (*latency_ms) += hw_api_latency[STM32WL3X_HW_API_LATENCY_DE_INIT_RX];
    }
#endif
#if (defined SIGFOX_EP_PARAMETERS_CHECK) || (defined SIGFOX_EP_ERROR_CODES)
errors:
#endif
    SIGFOX_RETURN();
}
#endif

#ifdef SIGFOX_EP_CERTIFICATION
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_start_continuous_wave(void) {
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    // Modulated CW is not supported for now.
    if (HAL_MRSubG_GetModulation() != MOD_CW) {
        SIGFOX_EXIT_ERROR((RF_API_status_t) STM32WL3X_RF_API_ERROR_MODULATION);
    }
    // Start radio.
    LL_MRSubG_StrobeCommand(CMD_LOCKTX);
#ifdef SIGFOX_EP_ERROR_CODES
    status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_LOCKONTX);
    SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
    _STM32WL3X_rf_api_wait_for_state_switch(STATE_LOCKONTX);
#endif
    LL_MRSubG_StrobeCommand(CMD_TX);
#ifdef SIGFOX_EP_ERROR_CODES
    status = _STM32WL3X_rf_api_wait_for_state_switch(STATE_TX);
    SIGFOX_CHECK_STATUS(RF_API_SUCCESS);
#else
    _STM32WL3X_rf_api_wait_for_state_switch(STATE_TX);
#endif
errors:
    SIGFOX_RETURN();
}
#endif

#ifdef SIGFOX_EP_VERBOSE
/*******************************************************************/
RF_API_status_t STM32WL3X_RF_API_get_version(sfx_u8 **version, sfx_u8 *version_size_char) {
#ifdef SIGFOX_EP_ERROR_CODES
    RF_API_status_t status = RF_API_SUCCESS;
#endif
    (*version) = (sfx_u8*) STM32WL3X_RF_API_VERSION;
    (*version_size_char) = (sfx_u8) sizeof(STM32WL3X_RF_API_VERSION);
    SIGFOX_RETURN();
}
#endif

#ifdef SIGFOX_EP_ERROR_CODES
/*******************************************************************/
void STM32WL3X_RF_API_error(void) {
    // Turn radio off.
    STM32WL3X_RF_API_de_init();
    STM32WL3X_RF_API_sleep();
}
#endif

/*** STM32WL3X RF API functions mapping ***/

#ifndef SIGFOX_EP_DYNAMIC_RF_API

#if (defined SIGFOX_EP_ASYNCHRONOUS) || (defined SIGFOX_EP_LOW_LEVEL_OPEN_CLOSE)
/*******************************************************************/
RF_API_status_t RF_API_open(RF_API_config_t *rf_api_config) {
    return STM32WL3X_RF_API_open(rf_api_config);
}
#endif

#ifdef SIGFOX_EP_LOW_LEVEL_OPEN_CLOSE
/*******************************************************************/
RF_API_status_t RF_API_close(void) {
    return STM32WL3X_RF_API_close();
}
#endif

#ifdef SIGFOX_EP_ASYNCHRONOUS
/*******************************************************************/
RF_API_status_t RF_API_process(void) {
    return STM32WL3X_RF_API_process();
}
#endif

/*******************************************************************/
RF_API_status_t RF_API_wake_up(void) {
    return STM32WL3X_RF_API_wake_up();
}

/*******************************************************************/
RF_API_status_t RF_API_sleep(void) {
    return STM32WL3X_RF_API_sleep();
}

/*******************************************************************/
RF_API_status_t RF_API_init(RF_API_radio_parameters_t *radio_parameters) {
    return STM32WL3X_RF_API_init(radio_parameters);
}

/*******************************************************************/
RF_API_status_t RF_API_de_init(void) {
    return STM32WL3X_RF_API_de_init();
}

/*******************************************************************/
RF_API_status_t RF_API_send(RF_API_tx_data_t *tx_data) {
    return STM32WL3X_RF_API_send(tx_data);
}

#ifdef SIGFOX_EP_BIDIRECTIONAL
/*******************************************************************/
RF_API_status_t RF_API_receive(RF_API_rx_data_t *rx_data) {
    return STM32WL3X_RF_API_receive(rx_data);
}
#endif

#ifdef SIGFOX_EP_BIDIRECTIONAL
/*******************************************************************/
RF_API_status_t RF_API_get_dl_phy_content_and_rssi(sfx_u8 *dl_phy_content, sfx_u8 dl_phy_content_size, sfx_s16 *dl_rssi_dbm) {
    return STM32WL3X_RF_API_get_dl_phy_content_and_rssi(dl_phy_content, dl_phy_content_size, dl_rssi_dbm);
}
#endif

#if (defined SIGFOX_EP_REGULATORY) && (defined SIGFOX_EP_SPECTRUM_ACCESS_LBT)
/*******************************************************************/
RF_API_status_t RF_API_carrier_sense(RF_API_carrier_sense_parameters_t *carrier_sense_params) {
    return STM32WL3X_RF_API_carrier_sense(carrier_sense_params);
}
#endif

#if (defined SIGFOX_EP_TIMER_REQUIRED) && (defined SIGFOX_EP_LATENCY_COMPENSATION)
/*******************************************************************/
RF_API_status_t RF_API_get_latency(RF_API_latency_t latency_type, sfx_u32 *latency_ms) {
    return STM32WL3X_RF_API_get_latency(latency_type, latency_ms);
}
#endif

#ifdef SIGFOX_EP_CERTIFICATION
/*******************************************************************/
RF_API_status_t RF_API_start_continuous_wave(void) {
    return STM32WL3X_RF_API_start_continuous_wave();
}
#endif

#ifdef SIGFOX_EP_VERBOSE
/*******************************************************************/
RF_API_status_t RF_API_get_version(sfx_u8 **version, sfx_u8 *version_size_char) {
    return STM32WL3X_RF_API_get_version(version, version_size_char);
}
#endif

#ifdef SIGFOX_EP_ERROR_CODES
/*******************************************************************/
void RF_API_error(void) {
    STM32WL3X_RF_API_error();
}
#endif

#endif /* DYNAMIC_RF_API */
